package learn.demo.数据.Json;

import com.alibaba.fastjson.JSON;
import com.alibaba.fastjson.JSONArray;
import com.alibaba.fastjson.JSONObject;
import org.apache.commons.lang3.StringUtils;

import java.util.List;
import java.util.Optional;
import java.util.stream.Collectors;

/**
 * @FileName: JsonTest
 * @Author: code-fusheng
 * @Date: 2022/5/6 15:50
 * @Version: 1.0
 * @Description:
 */

public class JsonTest {

    static String str = "{\n" +
            "    \"statusCode\": 1,\n" +
            "    \"statusMessage\": \"请求成功\",\n" +
            "    \"data\": {\n" +
            "        \"Paging\": {\n" +
            "            \"PageSize\": 10,\n" +
            "            \"PageIndex\": 1,\n" +
            "            \"TotalRecords\": 66\n" +
            "        },\n" +
            "        \"Items\": [\n" +
            "            {\n" +
            "                \"Category\": null,\n" +
            "                \"PublishDate\": null,\n" +
            "                \"VersionNo\": \"V1.0\",\n" +
            "                \"RegisterNo\": \"2021SR0796572\",\n" +
            "                \"RegisterAperDate\": \"2021-05-31 00:00:00\",\n" +
            "                \"Name\": \"企业服务推荐产品复购系统\",\n" +
            "                \"ShortName\": \"-\",\n" +
            "                \"Owner\": \"汉唐信通（北京）科技有限公司\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"Category\": null,\n" +
            "                \"PublishDate\": null,\n" +
            "                \"VersionNo\": \"V1.0\",\n" +
            "                \"RegisterNo\": \"2021SR0326284\",\n" +
            "                \"RegisterAperDate\": \"2021-03-02 00:00:00\",\n" +
            "                \"Name\": \"工商数据处理系统\",\n" +
            "                \"ShortName\": null,\n" +
            "                \"Owner\": \"汉唐信通（北京）科技有限公司\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"Category\": null,\n" +
            "                \"PublishDate\": null,\n" +
            "                \"VersionNo\": \"V1.0\",\n" +
            "                \"RegisterNo\": \"2021SR0326283\",\n" +
            "                \"RegisterAperDate\": \"2021-03-02 00:00:00\",\n" +
            "                \"Name\": \"工商数据处理程序\",\n" +
            "                \"ShortName\": null,\n" +
            "                \"Owner\": \"汉唐信通（北京）科技有限公司\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"Category\": \"30200-0000\",\n" +
            "                \"PublishDate\": \"2019-01-28 00:00:00\",\n" +
            "                \"VersionNo\": \"V1.0\",\n" +
            "                \"RegisterNo\": \"2019SR1110958\",\n" +
            "                \"RegisterAperDate\": \"2019-11-01 00:00:00\",\n" +
            "                \"Name\": \"蜂擎云服CRM系统\",\n" +
            "                \"ShortName\": \"蜂擎云服CRM\",\n" +
            "                \"Owner\": \"汉唐信通（北京）科技有限公司\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"Category\": \"30200-0000\",\n" +
            "                \"PublishDate\": \"2019-10-19 00:00:00\",\n" +
            "                \"VersionNo\": \"V1.0\",\n" +
            "                \"RegisterNo\": \"2019SR1111156\",\n" +
            "                \"RegisterAperDate\": \"2019-11-01 00:00:00\",\n" +
            "                \"Name\": \"知圈圈知识产权公众平台\",\n" +
            "                \"ShortName\": \"知圈圈\",\n" +
            "                \"Owner\": \"汉唐信通（北京）科技有限公司\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"Category\": \"30200-0000\",\n" +
            "                \"PublishDate\": \"2019-01-30 00:00:00\",\n" +
            "                \"VersionNo\": \"V1.0\",\n" +
            "                \"RegisterNo\": \"2019SR1111186\",\n" +
            "                \"RegisterAperDate\": \"2019-11-01 00:00:00\",\n" +
            "                \"Name\": \"公司宝蜂擎云服工具箱软件\",\n" +
            "                \"ShortName\": \"工具箱\",\n" +
            "                \"Owner\": \"汉唐信通（北京）科技有限公司\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"Category\": \"30200-0000\",\n" +
            "                \"PublishDate\": \"2019-04-30 00:00:00\",\n" +
            "                \"VersionNo\": \"V1.0.6\",\n" +
            "                \"RegisterNo\": \"2019SR1110980\",\n" +
            "                \"RegisterAperDate\": \"2019-11-01 00:00:00\",\n" +
            "                \"Name\": \"薪必果商户结算系统\",\n" +
            "                \"ShortName\": \"薪必果\",\n" +
            "                \"Owner\": \"汉唐信通（北京）科技有限公司\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"Category\": \"30200-0000\",\n" +
            "                \"PublishDate\": \"2019-09-11 00:00:00\",\n" +
            "                \"VersionNo\": \"V1.0\",\n" +
            "                \"RegisterNo\": \"2019SR1111166\",\n" +
            "                \"RegisterAperDate\": \"2019-11-01 00:00:00\",\n" +
            "                \"Name\": \"ImBoss智能商事服务平台\",\n" +
            "                \"ShortName\": \"ImBoss\",\n" +
            "                \"Owner\": \"汉唐信通（北京）科技有限公司\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"Category\": \"30200-0000\",\n" +
            "                \"PublishDate\": \"2019-01-25 00:00:00\",\n" +
            "                \"VersionNo\": \"V1.0\",\n" +
            "                \"RegisterNo\": \"2019SR1110956\",\n" +
            "                \"RegisterAperDate\": \"2019-11-01 00:00:00\",\n" +
            "                \"Name\": \"标眼查系统\",\n" +
            "                \"ShortName\": \"标眼查\",\n" +
            "                \"Owner\": \"汉唐信通（北京）科技有限公司\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"Category\": \"30200-0000\",\n" +
            "                \"PublishDate\": \"2019-04-08 00:00:00\",\n" +
            "                \"VersionNo\": \"V1.0\",\n" +
            "                \"RegisterNo\": \"2019SR1111160\",\n" +
            "                \"RegisterAperDate\": \"2019-11-01 00:00:00\",\n" +
            "                \"Name\": \"知圈圈商标交易平台\",\n" +
            "                \"ShortName\": \"商标交易平台\",\n" +
            "                \"Owner\": \"汉唐信通（北京）科技有限公司\"\n" +
            "            }\n" +
            "        ]\n" +
            "    },\n" +
            "    \"orderNo\": 1522478744789512200\n" +
            "}";

    static String str2 = "{\n" +
            "    \"error_code\": 0,\n" +
            "    \"reason\": \"OK\",\n" +
            "    \"result\": {\n" +
            "        \"total\": 10,\n" +
            "        \"items\": [\n" +
            "            {\n" +
            "                \"baseInfo\": {\n" +
            "                    \"id\": 644460,\n" +
            "                    \"amount\": \"120000万人民币\",\n" +
            "                    \"base\": \"\",\n" +
            "                    \"cancelDate\": \"\",\n" +
            "                    \"cancelReason\": \"\",\n" +
            "                    \"overviewAmount\": \"120000万人民币\",\n" +
            "                    \"overviewRemark\": \"\",\n" +
            "                    \"overviewScope\": \"主债权及实现债权费用\",\n" +
            "                    \"overviewTerm\": \"2019-04-16至2024-03-05\",\n" +
            "                    \"overviewType\": \"借贷合同\",\n" +
            "                    \"publishDate\": \"\",\n" +
            "                    \"regDate\": \"2020-04-08\",\n" +
            "                    \"regDepartment\": \"福建省宁德市蕉城区市场监督管理局\",\n" +
            "                    \"regNum\": \"35092020004960\",\n" +
            "                    \"remark\": \"所报材料真实合法，一切责任由当事人自负。\",\n" +
            "                    \"scope\": \"主债权及实现债权费用\",\n" +
            "                    \"status\": \"有效\",\n" +
            "                    \"term\": \"2019-04-16至2024-03-05\",\n" +
            "                    \"type\": \"借贷合同\"\n" +
            "                },\n" +
            "                \"changeInfoList\": [],\n" +
            "                \"pawnInfoList\": [\n" +
            "                    {\n" +
            "                        \"detail\": \"1台\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司所有\",\n" +
            "                        \"pawnName\": \"自动化成机\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"1台\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司所有\",\n" +
            "                        \"pawnName\": \"包蓝膜机\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"1台\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司所有\",\n" +
            "                        \"pawnName\": \"自动容量机\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"1台\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司所有\",\n" +
            "                        \"pawnName\": \"自动卷绕机\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"1台\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司所有\",\n" +
            "                        \"pawnName\": \"自动容量机\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"1台\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司所有\",\n" +
            "                        \"pawnName\": \"自动化成机\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"1台\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司所有\",\n" +
            "                        \"pawnName\": \"自动容量机\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"1台\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司所有\",\n" +
            "                        \"pawnName\": \"自动卷绕机\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"1台\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司所有\",\n" +
            "                        \"pawnName\": \"自动化成机\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"1台\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司所有\",\n" +
            "                        \"pawnName\": \"包蓝膜机\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    }\n" +
            "                ],\n" +
            "                \"peopleInfo\": [\n" +
            "                    {\n" +
            "                        \"licenseNum\": \"913509000708990230\",\n" +
            "                        \"licenseType\": \"营业执照\",\n" +
            "                        \"peopleName\": \"中信银行股份有限公司宁德分行\"\n" +
            "                    }\n" +
            "                ]\n" +
            "            },\n" +
            "            {\n" +
            "                \"baseInfo\": {\n" +
            "                    \"id\": 5566,\n" +
            "                    \"amount\": \"15917.945809万人民币\",\n" +
            "                    \"base\": \"\",\n" +
            "                    \"cancelDate\": \"\",\n" +
            "                    \"cancelReason\": \"\",\n" +
            "                    \"overviewAmount\": \"15917.945809万人民币\",\n" +
            "                    \"overviewRemark\": \"\",\n" +
            "                    \"overviewScope\": \"主债权及利息、违约金、损害赔偿金和实现抵押权等费用\",\n" +
            "                    \"overviewTerm\": \"2018-09-12至2021-12-31\",\n" +
            "                    \"overviewType\": \"其他债权\",\n" +
            "                    \"publishDate\": \"2018-09-29\",\n" +
            "                    \"regDate\": \"2018-09-29\",\n" +
            "                    \"regDepartment\": \"宁德市蕉城区市场监督管理局\",\n" +
            "                    \"regNum\": \"350902180007-1\",\n" +
            "                    \"remark\": \"所报材料真实合法，一切责任由当事人自负。\",\n" +
            "                    \"scope\": \"主债权及利息、违约金、损害赔偿金和实现抵押权等费用\",\n" +
            "                    \"status\": \"有效\",\n" +
            "                    \"term\": \"2018-09-12至2021-12-31\",\n" +
            "                    \"type\": \"其他债权\"\n" +
            "                },\n" +
            "                \"changeInfoList\": [],\n" +
            "                \"pawnInfoList\": [],\n" +
            "                \"peopleInfo\": [\n" +
            "                    {\n" +
            "                        \"licenseNum\": \"91350900857420426G\",\n" +
            "                        \"licenseType\": \"营业执照\",\n" +
            "                        \"peopleName\": \"兴业银行股份有限公司宁德分行\"\n" +
            "                    }\n" +
            "                ]\n" +
            "            },\n" +
            "            {\n" +
            "                \"baseInfo\": {\n" +
            "                    \"id\": 227229,\n" +
            "                    \"amount\": \"15000万人民币\",\n" +
            "                    \"base\": \"\",\n" +
            "                    \"cancelDate\": \"\",\n" +
            "                    \"cancelReason\": \"\",\n" +
            "                    \"overviewAmount\": \"15000万人民币\",\n" +
            "                    \"overviewRemark\": \"\",\n" +
            "                    \"overviewScope\": \"主债权及利息、违约金、损害赔偿金和实现抵押权等费用\",\n" +
            "                    \"overviewTerm\": \"2017-06-08至2020-12-06\",\n" +
            "                    \"overviewType\": \"其他债权\",\n" +
            "                    \"publishDate\": \"2018-09-29\",\n" +
            "                    \"regDate\": \"2018-09-29\",\n" +
            "                    \"regDepartment\": \"宁德市蕉城区市场监督管理局\",\n" +
            "                    \"regNum\": \"350902180006-2\",\n" +
            "                    \"remark\": \"所报材料真实合法，一切责任由当事人自负。\",\n" +
            "                    \"scope\": \"主债权及利息、违约金、损害赔偿金和实现抵押权等费用\",\n" +
            "                    \"status\": \"有效\",\n" +
            "                    \"term\": \"2017-06-08至2020-12-06\",\n" +
            "                    \"type\": \"其他债权\"\n" +
            "                },\n" +
            "                \"changeInfoList\": [\n" +
            "                    {\n" +
            "                        \"changeContent\": \"【抵押物1】名称:电池极片涂层机,所有权归属:宁德时代新能源科技股份有限公司,数量:6.0,单位:台,质量:良好,所在地:宁德,状况:良好,价值:null,品牌名称:null,型号规格:null,出厂日期:null,可使用年限:null\n" +
            "【抵押物2】名称:自动引导无人搬运车,所有权归属:宁德时代新能源科技股份有限公司,数量:4.0,单位:台,质量:良好,所在地:宁德,状况:良好,价值:null,品牌名称:null,型号规格:null,出厂日期:null,可使用年限:null\n" +
            "【抵押物3】名称:电箱装配线,所有权归属:宁德时代新能源科技股份有限公司,数量:1.0,单位:台,质量:良好,所在地:宁德,状况:良好,价值:null,品牌名称:null,型号规格:null,出厂日期:null,可使用年限:null\n" +
            "【抵押物4】名称:自动化成测试机,所有权归属:宁德时代新能源科技股份有限公司,数量:1.0,单位:台,质量:良好,所在地:宁德,状况:良好,价值:null,品牌名称:null,型号规格:null,出厂日期:null,可使用年限:null\n" +
            "【抵押物5】名称:气密性测试机,所有权归属:宁德时代新能源科技股份有限公司,数量:1.0,单位:台,质量:良好,所在地:宁德,状况:良好,价值:null,品牌名称:null,型号规格:null,出厂日期:null,可使用年限:null\n" +
            "【抵押物6】名称:顶盖激光焊接机,所有权归属:宁德时代新能源科技股份有限公司,数量:1.0,单位:台,质量:良好,所在地:宁德,状况:良好,价值:null,品牌名称:null,型号规格:null,出厂日期:null,可使用年限:null\n" +
            "【抵押物7】名称:防爆片焊接机,所有权归属:宁德时代新能源科技股份有限公司,数量:1.0,单位:台,质量:良好,所在地:宁德,状况:良好,价值:null,品牌名称:null,型号规格:null,出厂日期:null,可使用年限:null\n" +
            "\",\n" +
            "                        \"changeDate\": \"2019-05-06\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"changeContent\": \"【抵押物1】名称:电池极片涂层机,所有权归属:宁德时代新能源科技股份有限公司,数量:6.0,单位:台,质量:良好,所在地:宁德,状况:良好,价值:null,品牌名称:null,型号规格:null,出厂日期:null,可使用年限:null\n" +
            "【抵押物2】名称:自动引导无人搬运车,所有权归属:宁德时代新能源科技股份有限公司,数量:4.0,单位:台,质量:良好,所在地:宁德,状况:良好,价值:null,品牌名称:null,型号规格:null,出厂日期:null,可使用年限:null\n" +
            "【抵押物3】名称:电箱装配线,所有权归属:宁德时代新能源科技股份有限公司,数量:1.0,单位:台,质量:良好,所在地:宁德,状况:良好,价值:null,品牌名称:null,型号规格:null,出厂日期:null,可使用年限:null\n" +
            "【抵押物4】名称:自动化成测试机,所有权归属:宁德时代新能源科技股份有限公司,数量:1.0,单位:台,质量:良好,所在地:宁德,状况:良好,价值:null,品牌名称:null,型号规格:null,出厂日期:null,可使用年限:null\n" +
            "【抵押物5】名称:气密性测试机,所有权归属:宁德时代新能源科技股份有限公司,数量:1.0,单位:台,质量:良好,所在地:宁德,状况:良好,价值:null,品牌名称:null,型号规格:null,出厂日期:null,可使用年限:null\n" +
            "【抵押物6】名称:顶盖激光焊接机,所有权归属:宁德时代新能源科技股份有限公司,数量:1.0,单位:台,质量:良好,所在地:宁德,状况:良好,价值:null,品牌名称:null,型号规格:null,出厂日期:null,可使用年限:null\n" +
            "【抵押物7】名称:防爆片焊接机,所有权归属:宁德时代新能源科技股份有限公司,数量:1.0,单位:台,质量:良好,所在地:宁德,状况:良好,价值:null,品牌名称:null,型号规格:null,出厂日期:null,可使用年限:null\n" +
            "\",\n" +
            "                        \"changeDate\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"changeContent\": \"【抵押物1】名称:电池极片涂层机,所有权归属:宁德时代新能源科技股份有限公司,数量:6.0,单位:台,质量:良好,所在地:福建,状况:完好,价值:null,品牌名称:null,型号规格:null,出厂日期:null,可使用年限:null\n" +
            "【抵押物2】名称:自动引导无人搬运车,所有权归属:宁德时代新能源科技股份有限公司,数量:4.0,单位:台,质量:良好,所在地:福建,状况:完好,价值:null,品牌名称:null,型号规格:null,出厂日期:null,可使用年限:null\n" +
            "【抵押物3】名称:阴极粉料配料系统,所有权归属:宁德时代新能源科技股份有限公司,数量:2.0,单位:台,质量:良好,所在地:福建,状况:完好,价值:null,品牌名称:null,型号规格:null,出厂日期:null,可使用年限:null\n" +
            "【抵押物4】名称:电箱装配线,所有权归属:宁德时代新能源科技股份有限公司,数量:1.0,单位:台,质量:良好,所在地:福建,状况:完好,价值:null,品牌名称:null,型号规格:null,出厂日期:null,可使用年限:null\n" +
            "\",\n" +
            "                        \"changeDate\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"changeContent\": \"【抵押物1】名称:电池极片涂层机,所有权归属:宁德时代新能源科技股份有限公司,数量:6.0,单位:台,质量:良好,所在地:福建,状况:完好,价值:null,品牌名称:null,型号规格:null,出厂日期:null,可使用年限:null\n" +
            "【抵押物2】名称:自动引导无人搬运车,所有权归属:宁德时代新能源科技股份有限公司,数量:4.0,单位:台,质量:良好,所在地:福建,状况:完好,价值:null,品牌名称:null,型号规格:null,出厂日期:null,可使用年限:null\n" +
            "【抵押物3】名称:阴极粉料配料系统,所有权归属:宁德时代新能源科技股份有限公司,数量:2.0,单位:台,质量:良好,所在地:福建,状况:完好,价值:null,品牌名称:null,型号规格:null,出厂日期:null,可使用年限:null\n" +
            "【抵押物4】名称:电箱装配线,所有权归属:宁德时代新能源科技股份有限公司,数量:1.0,单位:台,质量:良好,所在地:福建,状况:完好,价值:null,品牌名称:null,型号规格:null,出厂日期:null,可使用年限:null\n" +
            "\",\n" +
            "                        \"changeDate\": \"2018-10-12\"\n" +
            "                    }\n" +
            "                ],\n" +
            "                \"pawnInfoList\": [],\n" +
            "                \"peopleInfo\": [\n" +
            "                    {\n" +
            "                        \"licenseNum\": \"91350900857420426G\",\n" +
            "                        \"licenseType\": \"营业执照\",\n" +
            "                        \"peopleName\": \"兴业银行股份有限公司宁德分行\"\n" +
            "                    }\n" +
            "                ]\n" +
            "            },\n" +
            "            {\n" +
            "                \"baseInfo\": {\n" +
            "                    \"id\": 199810,\n" +
            "                    \"amount\": \"60000万人民币\",\n" +
            "                    \"base\": \"\",\n" +
            "                    \"cancelDate\": \"\",\n" +
            "                    \"cancelReason\": \"\",\n" +
            "                    \"overviewAmount\": \"60000万人民币\",\n" +
            "                    \"overviewRemark\": \"\",\n" +
            "                    \"overviewScope\": \"主债权及利息、违约金、损害赔偿金和实现抵押权等费用\",\n" +
            "                    \"overviewTerm\": \"2018-02-26至2023-05-26\",\n" +
            "                    \"overviewType\": \"财物债权\",\n" +
            "                    \"publishDate\": \"2018-02-28\",\n" +
            "                    \"regDate\": \"2018-02-28\",\n" +
            "                    \"regDepartment\": \"宁德市蕉城区市场监督管理局\",\n" +
            "                    \"regNum\": \"350902180001-2\",\n" +
            "                    \"remark\": \"所报材料真实合法，一切责任由当事人自负。\",\n" +
            "                    \"scope\": \"主债权及利息、违约金、损害赔偿金和实现抵押权等费用\",\n" +
            "                    \"status\": \"有效\",\n" +
            "                    \"term\": \"2018-02-26至2023-05-26\",\n" +
            "                    \"type\": \"财物债权\"\n" +
            "                },\n" +
            "                \"changeInfoList\": [],\n" +
            "                \"pawnInfoList\": [],\n" +
            "                \"peopleInfo\": [\n" +
            "                    {\n" +
            "                        \"licenseNum\": \"91350900705303650X\",\n" +
            "                        \"licenseType\": \"营业执照\",\n" +
            "                        \"peopleName\": \"中国工商银行股份有限公司宁德蕉城支行\"\n" +
            "                    }\n" +
            "                ]\n" +
            "            },\n" +
            "            {\n" +
            "                \"baseInfo\": {\n" +
            "                    \"id\": 249379,\n" +
            "                    \"amount\": \"50000万人民币\",\n" +
            "                    \"base\": \"\",\n" +
            "                    \"cancelDate\": \"\",\n" +
            "                    \"cancelReason\": \"\",\n" +
            "                    \"overviewAmount\": \"50000万人民币\",\n" +
            "                    \"overviewRemark\": \"\",\n" +
            "                    \"overviewScope\": \"因本金而发生的债务利息、罚息、复利、违约金、损害赔偿金及实现债权的费用（包括但不限于诉讼费、律师费、保全费、公告费、执行费等）和其他所有应付的费用不占用该最高额度，但构成主债权的组成部分，属于担保责任的范围（担保范围包括债务本金、利息、罚息、复利、违约金、损害赔偿金、为实现债权的费用和其他所有应付的费用）\",\n" +
            "                    \"overviewTerm\": \"2017-11-27至2023-05-22\",\n" +
            "                    \"overviewType\": \"财物债权\",\n" +
            "                    \"publishDate\": \"2017-11-28\",\n" +
            "                    \"regDate\": \"2017-11-28\",\n" +
            "                    \"regDepartment\": \"福建省宁德市蕉城区工商行政管理局\",\n" +
            "                    \"regNum\": \"350902170011-1\",\n" +
            "                    \"remark\": \"所报材料真实合法，一切责任由当事人自负。\",\n" +
            "                    \"scope\": \"因本金而发生的债务利息、罚息、复利、违约金、损害赔偿金及实现债权的费用（包括但不限于诉讼费、律师费、保全费、公告费、执行费等）和其他所有应付的费用不占用该最高额度，但构成主债权的组成部分，属于担保责任的范围（担保范围包括债务本金、利息、罚息、复利、违约金、损害赔偿金、为实现债权的费用和其他所有应付的费用）\",\n" +
            "                    \"status\": \"有效\",\n" +
            "                    \"term\": \"2017-11-27至2023-05-22\",\n" +
            "                    \"type\": \"财物债权\"\n" +
            "                },\n" +
            "                \"changeInfoList\": [],\n" +
            "                \"pawnInfoList\": [\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：1.00；质量：良好；状况：完好；所在地：福建\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司\",\n" +
            "                        \"pawnName\": \"针床式化成机\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：22.00；质量：良好；状况：完好；所在地：福建\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司\",\n" +
            "                        \"pawnName\": \"化成机\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：18.00；质量：良好；状况：完好；所在地：福建\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司\",\n" +
            "                        \"pawnName\": \"测试恒温箱\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：1.00；质量：良好；状况：完好；所在地：福建\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司\",\n" +
            "                        \"pawnName\": \"目检物流线\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：1.00；质量：良好；状况：完好；所在地：福建\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司\",\n" +
            "                        \"pawnName\": \"平面度测量机\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：6.00；质量：良好；状况：完好；所在地：福建\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司\",\n" +
            "                        \"pawnName\": \"热冲击箱\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：6.00；质量：良好；状况：完好；所在地：福建\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司\",\n" +
            "                        \"pawnName\": \"交换机\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：87.00；质量：良好；状况：完好；所在地：福建\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司\",\n" +
            "                        \"pawnName\": \"容量测试机\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：2.00；质量：良好；状况：完好；所在地：福建\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司\",\n" +
            "                        \"pawnName\": \"转接片激光焊接机\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：3.00；质量：良好；状况：完好；所在地：福建\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司\",\n" +
            "                        \"pawnName\": \"存储系统\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    }\n" +
            "                ],\n" +
            "                \"peopleInfo\": [\n" +
            "                    {\n" +
            "                        \"licenseNum\": \"913500005653673878\",\n" +
            "                        \"licenseType\": \"营业执照\",\n" +
            "                        \"peopleName\": \"中国进出口银行福建省分行\"\n" +
            "                    }\n" +
            "                ]\n" +
            "            },\n" +
            "            {\n" +
            "                \"baseInfo\": {\n" +
            "                    \"id\": 232835,\n" +
            "                    \"amount\": \"50000万人民币\",\n" +
            "                    \"base\": \"\",\n" +
            "                    \"cancelDate\": \"\",\n" +
            "                    \"cancelReason\": \"\",\n" +
            "                    \"overviewAmount\": \"50000万人民币\",\n" +
            "                    \"overviewRemark\": \"\",\n" +
            "                    \"overviewScope\": \"因本金而发生的债务利息、罚息、复利、违约金、损害赔偿金及实现债权的费用（包括但不限于诉讼费、律师费、保全费、公告费、执行费等）和其他所有应付的费用不占用该最高额度，但构成主债权的组成部分，属于担保责任的范围（担保范围包括债务本金、利息、罚息、复利、违约金、损害赔偿金、为实现债权的费用和其他所有应付的费用）\",\n" +
            "                    \"overviewTerm\": \"2017-09-26至2023-09-21\",\n" +
            "                    \"overviewType\": \"财物债权\",\n" +
            "                    \"publishDate\": \"2017-09-28\",\n" +
            "                    \"regDate\": \"2017-09-28\",\n" +
            "                    \"regDepartment\": \"福建省宁德市蕉城区工商行政管理局\",\n" +
            "                    \"regNum\": \"350902170009-1\",\n" +
            "                    \"remark\": \"所报材料真实合法，一切责任由当事人自负。\",\n" +
            "                    \"scope\": \"因本金而发生的债务利息、罚息、复利、违约金、损害赔偿金及实现债权的费用（包括但不限于诉讼费、律师费、保全费、公告费、执行费等）和其他所有应付的费用不占用该最高额度，但构成主债权的组成部分，属于担保责任的范围（担保范围包括债务本金、利息、罚息、复利、违约金、损害赔偿金、为实现债权的费用和其他所有应付的费用）\",\n" +
            "                    \"status\": \"有效\",\n" +
            "                    \"term\": \"2017-09-26至2023-09-21\",\n" +
            "                    \"type\": \"财物债权\"\n" +
            "                },\n" +
            "                \"changeInfoList\": [],\n" +
            "                \"pawnInfoList\": [\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：1.00；质量：良好；状况：完好；所在地：福建\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司\",\n" +
            "                        \"pawnName\": \"风冷式高低温交变湿热试验箱\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：1.00；质量：良好；状况：完好；所在地：福建\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司\",\n" +
            "                        \"pawnName\": \"激光器\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：14.00；质量：良好；状况：完好；所在地：福建\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司\",\n" +
            "                        \"pawnName\": \"NMP储罐\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：3.00；质量：良好；状况：完好；所在地：福建\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司\",\n" +
            "                        \"pawnName\": \"电压内阻测试机\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：23.00；质量：良好；状况：完好；所在地：福建\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司\",\n" +
            "                        \"pawnName\": \"抽气封口机\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：12.00；质量：良好；状况：完好；所在地：福建\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司\",\n" +
            "                        \"pawnName\": \"智能吊装系统\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：2.00；质量：良好；状况：完好；所在地：福建\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司\",\n" +
            "                        \"pawnName\": \"氦质谱检漏仪\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：1.00；质量：良好；状况：完好；所在地：福建\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司\",\n" +
            "                        \"pawnName\": \"最终气密性测试机\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：12.00；质量：良好；状况：完好；所在地：福建\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司\",\n" +
            "                        \"pawnName\": \"抽气封口段物流线\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：11.00；质量：良好；状况：完好；所在地：福建\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司\",\n" +
            "                        \"pawnName\": \"自动入化成钉机\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    }\n" +
            "                ],\n" +
            "                \"peopleInfo\": [\n" +
            "                    {\n" +
            "                        \"licenseNum\": \"913500005653673878\",\n" +
            "                        \"licenseType\": \"营业执照\",\n" +
            "                        \"peopleName\": \"中国进出口银行福建省分行\"\n" +
            "                    }\n" +
            "                ]\n" +
            "            },\n" +
            "            {\n" +
            "                \"baseInfo\": {\n" +
            "                    \"id\": 326464,\n" +
            "                    \"amount\": \"12000万人民币\",\n" +
            "                    \"base\": \"\",\n" +
            "                    \"cancelDate\": \"\",\n" +
            "                    \"cancelReason\": \"\",\n" +
            "                    \"overviewAmount\": \"12000万人民币\",\n" +
            "                    \"overviewRemark\": \"\",\n" +
            "                    \"overviewScope\": \"主债权及利息、违约金、损害赔偿金和实现抵押权等费用\",\n" +
            "                    \"overviewTerm\": \"2016-12-27至2020-12-26\",\n" +
            "                    \"overviewType\": \"财物债权\",\n" +
            "                    \"publishDate\": \"2017-08-29\",\n" +
            "                    \"regDate\": \"2017-08-29\",\n" +
            "                    \"regDepartment\": \"福建省宁德市蕉城区工商行政管理局\",\n" +
            "                    \"regNum\": \"350902170006-1\",\n" +
            "                    \"remark\": \"所报材料真实合法，一切责任由当事人自负。\",\n" +
            "                    \"scope\": \"主债权及利息、违约金、损害赔偿金和实现抵押权等费用\",\n" +
            "                    \"status\": \"有效\",\n" +
            "                    \"term\": \"2016-12-27至2020-12-26\",\n" +
            "                    \"type\": \"财物债权\"\n" +
            "                },\n" +
            "                \"changeInfoList\": [],\n" +
            "                \"pawnInfoList\": [\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：4.00；质量：良好；状况：完好；所在地：福建\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司\",\n" +
            "                        \"pawnName\": \"覆膜压延补锂机控制软件V2.0\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：4.00；质量：良好；状况：完好；所在地：福建\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司\",\n" +
            "                        \"pawnName\": \"补锂机\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：1.00；质量：良好；状况：完好；所在地：福建\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司\",\n" +
            "                        \"pawnName\": \"提升机\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：2.00；质量：良好；状况：完好；所在地：福建\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司\",\n" +
            "                        \"pawnName\": \"粉料系统\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：8.00；质量：良好；状况：完好；所在地：福建\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司\",\n" +
            "                        \"pawnName\": \"辊压机\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：1.00；质量：良好；状况：完好；所在地：福建\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司\",\n" +
            "                        \"pawnName\": \"成品自动输送系统\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：1.00；质量：良好；状况：完好；所在地：福建\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司\",\n" +
            "                        \"pawnName\": \"思客琦自动化焊接系统控制软件\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：4.00；质量：良好；状况：完好；所在地：福建\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司\",\n" +
            "                        \"pawnName\": \"激光焊接机\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：2.00；质量：良好；状况：完好；所在地：福建\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司\",\n" +
            "                        \"pawnName\": \"AGV搬运系统\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：6.00；质量：良好；状况：完好；所在地：福建\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司\",\n" +
            "                        \"pawnName\": \"激光焊接机\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    }\n" +
            "                ],\n" +
            "                \"peopleInfo\": [\n" +
            "                    {\n" +
            "                        \"licenseNum\": \"91350900857420426G\",\n" +
            "                        \"licenseType\": \"营业执照\",\n" +
            "                        \"peopleName\": \"兴业银行股份有限公司宁德分行\"\n" +
            "                    }\n" +
            "                ]\n" +
            "            },\n" +
            "            {\n" +
            "                \"baseInfo\": {\n" +
            "                    \"id\": 122052,\n" +
            "                    \"amount\": \"38000万人民币\",\n" +
            "                    \"base\": \"\",\n" +
            "                    \"cancelDate\": \"2018-08-24\",\n" +
            "                    \"cancelReason\": \"主债权消灭\",\n" +
            "                    \"overviewAmount\": \"38000万人民币\",\n" +
            "                    \"overviewRemark\": \"\",\n" +
            "                    \"overviewScope\": \"主债权及利息、违约金、损害赔偿金和实现抵押权等费用\",\n" +
            "                    \"overviewTerm\": \"2016-12-27至2018-12-26\",\n" +
            "                    \"overviewType\": \"财物债权\",\n" +
            "                    \"publishDate\": \"2017-08-29\",\n" +
            "                    \"regDate\": \"2017-08-29\",\n" +
            "                    \"regDepartment\": \"宁德市蕉城区市场监督管理局\",\n" +
            "                    \"regNum\": \"350902170007-3\",\n" +
            "                    \"remark\": \"所报材料真实合法，一切责任由当事人自负。\",\n" +
            "                    \"scope\": \"主债权及利息、违约金、损害赔偿金和实现抵押权等费用\",\n" +
            "                    \"status\": \"无效\",\n" +
            "                    \"term\": \"2016-12-27至2018-12-26\",\n" +
            "                    \"type\": \"财物债权\"\n" +
            "                },\n" +
            "                \"changeInfoList\": [\n" +
            "                    {\n" +
            "                        \"changeContent\": \"债务履行期限:2016-12-27至2018-12-26\",\n" +
            "                        \"changeDate\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"changeContent\": \"债务履行期限:2016-12-27至2018-12-26\",\n" +
            "                        \"changeDate\": \"2018-01-03\"\n" +
            "                    }\n" +
            "                ],\n" +
            "                \"pawnInfoList\": [\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：1.00；质量：良好；状况：完好；所在地：福建\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司\",\n" +
            "                        \"pawnName\": \"浆料输送系统\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：1.00；质量：良好；状况：完好；所在地：福建\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司\",\n" +
            "                        \"pawnName\": \"侧板涂胶机\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：1.00；质量：良好；状况：完好；所在地：福建\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司\",\n" +
            "                        \"pawnName\": \"动力电池测试系统\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：1.00；质量：良好；状况：完好；所在地：福建\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司\",\n" +
            "                        \"pawnName\": \"动力电池测试系统\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：1.00；质量：良好；状况：完好；所在地：福建\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司\",\n" +
            "                        \"pawnName\": \"尺寸侧量段物流线\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：1.00；质量：良好；状况：完好；所在地：福建\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司\",\n" +
            "                        \"pawnName\": \"粉料系统增值\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：1.00；质量：良好；状况：完好；所在地：福建\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司\",\n" +
            "                        \"pawnName\": \"抽气封口段物流线\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：1.00；质量：良好；状况：完好；所在地：福建\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司\",\n" +
            "                        \"pawnName\": \"动力电池自动化成系统\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：2.00；质量：良好；状况：完好；所在地：福建\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司\",\n" +
            "                        \"pawnName\": \"阴极粉料配料系统\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：1.00；质量：良好；状况：完好；所在地：福建\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司\",\n" +
            "                        \"pawnName\": \"组件清洗涂胶机\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    }\n" +
            "                ],\n" +
            "                \"peopleInfo\": [\n" +
            "                    {\n" +
            "                        \"licenseNum\": \"91350900857420426G\",\n" +
            "                        \"licenseType\": \"营业执照\",\n" +
            "                        \"peopleName\": \"兴业银行股份有限公司宁德分行\"\n" +
            "                    }\n" +
            "                ]\n" +
            "            },\n" +
            "            {\n" +
            "                \"baseInfo\": {\n" +
            "                    \"id\": 210842,\n" +
            "                    \"amount\": \"40000万人民币\",\n" +
            "                    \"base\": \"\",\n" +
            "                    \"cancelDate\": \"\",\n" +
            "                    \"cancelReason\": \"\",\n" +
            "                    \"overviewAmount\": \"40000万人民币\",\n" +
            "                    \"overviewRemark\": \"\",\n" +
            "                    \"overviewScope\": \"主债权及利息、违约金、损害赔偿金和实现抵押权的费用\",\n" +
            "                    \"overviewTerm\": \"2017-07-06至2022-07-05\",\n" +
            "                    \"overviewType\": \"财物债权\",\n" +
            "                    \"publishDate\": \"2017-07-14\",\n" +
            "                    \"regDate\": \"2017-07-14\",\n" +
            "                    \"regDepartment\": \"宁德市蕉城区市场监督管理局\",\n" +
            "                    \"regNum\": \"350902170004-2\",\n" +
            "                    \"remark\": \"所报材料真实合法，一切责任由当事人自负。\",\n" +
            "                    \"scope\": \"主债权及利息、违约金、损害赔偿金和实现抵押权的费用\",\n" +
            "                    \"status\": \"有效\",\n" +
            "                    \"term\": \"2017-07-06至2022-07-05\",\n" +
            "                    \"type\": \"财物债权\"\n" +
            "                },\n" +
            "                \"changeInfoList\": [\n" +
            "                    {\n" +
            "                        \"changeContent\": \"【抵押物1】名称:FMA生产线,所有权归属:宁德时代新能源科技股份有限公司,数量:1.0,单位:台,质量:良好,所在地:福建,状况:完好,价值:null,品牌名称:null,型号规格:null,出厂日期:null,可使用年限:null\n" +
            "【抵押物2】名称:搬运车,所有权归属:宁德时代新能源科技股份有限公司,数量:2.0,单位:台,质量:良好,所在地:福建,状况:完好,价值:null,品牌名称:null,型号规格:null,出厂日期:null,可使用年限:null\n" +
            "【抵押物3】名称:闭式循环喷雾干燥机,所有权归属:宁德时代新能源科技股份有限公司,数量:1.0,单位:台,质量:良好,所在地:福建,状况:完好,价值:null,品牌名称:null,型号规格:null,出厂日期:null,可使用年限:null\n" +
            "【抵押物4】名称:侧板涂胶机,所有权归属:宁德时代新能源科技股份有限公司,数量:1.0,单位:台,质量:良好,所在地:福建,状况:完好,价值:null,品牌名称:null,型号规格:null,出厂日期:null,可使用年限:null\n" +
            "【抵押物5】名称:测漏仪,所有权归属:宁德时代新能源科技股份有限公司,数量:2.0,单位:台,质量:良好,所在地:福建,状况:完好,价值:null,品牌名称:null,型号规格:null,出厂日期:null,可使用年限:null\n" +
            "【抵押物6】名称:超声波焊接机,所有权归属:宁德时代新能源科技股份有限公司,数量:9.0,单位:台,质量:良好,所在地:福建,状况:完好,价值:null,品牌名称:null,型号规格:null,出厂日期:null,可使用年限:null\n" +
            "【抵押物7】名称:尺寸测量机,所有权归属:宁德时代新能源科技股份有限公司,数量:4.0,单位:台,质量:良好,所在地:福建,状况:完好,价值:null,品牌名称:null,型号规格:null,出厂日期:null,可使用年限:null\n" +
            "【抵押物8】名称:抽气封口机,所有权归属:宁德时代新能源科技股份有限公司,数量:2.0,单位:台,质量:良好,所在地:福建,状况:完好,价值:null,品牌名称:null,型号规格:null,出厂日期:null,可使用年限:null\n" +
            "【抵押物9】名称:存储,所有权归属:宁德时代新能源科技股份有限公司,数量:2\",\n" +
            "                        \"changeDate\": \"2018-09-12 13:00:00\"\n" +
            "                    }\n" +
            "                ],\n" +
            "                \"pawnInfoList\": [\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：1.00；质量：良好；状况：完好；所在地：福建\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司\",\n" +
            "                        \"pawnName\": \"焊接机\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：3.00；质量：良好；状况：完好；所在地：福建\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司\",\n" +
            "                        \"pawnName\": \"粉料系统\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：1.00；质量：良好；状况：完好；所在地：福建\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司\",\n" +
            "                        \"pawnName\": \"搅拌中央控制系统\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：2.00；质量：良好；状况：完好；所在地：福建\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司\",\n" +
            "                        \"pawnName\": \"极片成形机\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：2.00；质量：良好；状况：完好；所在地：福建\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司\",\n" +
            "                        \"pawnName\": \"冷压机\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：1.00；质量：良好；状况：完好；所在地：福建\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司\",\n" +
            "                        \"pawnName\": \"裸电芯装配线\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：22.00；质量：良好；状况：完好；所在地：福建\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司\",\n" +
            "                        \"pawnName\": \"真空干燥炉\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：1.00；质量：良好；状况：完好；所在地：福建\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司\",\n" +
            "                        \"pawnName\": \"三元前驱体反应系统\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：1.00；质量：良好；状况：完好；所在地：福建\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司\",\n" +
            "                        \"pawnName\": \"四通道拧紧系统\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：1.00；质量：良好；状况：完好；所在地：福建\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技股份有限公司\",\n" +
            "                        \"pawnName\": \"底板涂胶机\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    }\n" +
            "                ],\n" +
            "                \"peopleInfo\": [\n" +
            "                    {\n" +
            "                        \"licenseNum\": \"91350900705303650X\",\n" +
            "                        \"licenseType\": \"营业执照\",\n" +
            "                        \"peopleName\": \"中国工商银行股份有限公司宁德蕉城支行\"\n" +
            "                    }\n" +
            "                ]\n" +
            "            },\n" +
            "            {\n" +
            "                \"baseInfo\": {\n" +
            "                    \"id\": 381910,\n" +
            "                    \"amount\": \"125381万人民币\",\n" +
            "                    \"base\": \"\",\n" +
            "                    \"cancelDate\": \"2016-03-08\",\n" +
            "                    \"cancelReason\": \"主债权消灭\",\n" +
            "                    \"overviewAmount\": \"125381万人民币\",\n" +
            "                    \"overviewRemark\": \"\",\n" +
            "                    \"overviewScope\": \"主债权及利息、违约金、损害赔偿金和实现抵押权等费用\",\n" +
            "                    \"overviewTerm\": \"2015-10-01至2016-04-30\",\n" +
            "                    \"overviewType\": \"财物债权\",\n" +
            "                    \"publishDate\": \"2015-10-30\",\n" +
            "                    \"regDate\": \"2015-10-30\",\n" +
            "                    \"regDepartment\": \"福建省宁德市蕉城区工商行政管理局\",\n" +
            "                    \"regNum\": \"350902150008-3\",\n" +
            "                    \"remark\": \"所报材料真实合法，一切责任由当事人自负。\",\n" +
            "                    \"scope\": \"主债权及利息、违约金、损害赔偿金和实现抵押权等费用\",\n" +
            "                    \"status\": \"无效\",\n" +
            "                    \"term\": \"2015-10-01至2016-04-30\",\n" +
            "                    \"type\": \"财物债权\"\n" +
            "                },\n" +
            "                \"changeInfoList\": [],\n" +
            "                \"pawnInfoList\": [\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：20.00；质量：良好；状况：完好；所在地：宁德\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技有限公司\",\n" +
            "                        \"pawnName\": \"服务器\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：1.00；质量：良好；状况：完好；所在地：宁德\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技有限公司\",\n" +
            "                        \"pawnName\": \"终检测试机\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：1.00；质量：良好；状况：完好；所在地：宁德\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技有限公司\",\n" +
            "                        \"pawnName\": \"模组加压机\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：1.00；质量：良好；状况：完好；所在地：宁德\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技有限公司\",\n" +
            "                        \"pawnName\": \"包装机\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：1.00；质量：良好；状况：完好；所在地：宁德\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技有限公司\",\n" +
            "                        \"pawnName\": \"低压测试机\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：1.00；质量：良好；状况：完好；所在地：宁德\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技有限公司\",\n" +
            "                        \"pawnName\": \"半成品\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：1.00；质量：良好；状况：完好；所在地：宁德\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技有限公司\",\n" +
            "                        \"pawnName\": \"裸电芯装配线 EV CELL ASSEMBLY LINE 4PPM\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：2.00；质量：良好；状况：完好；所在地：宁德\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技有限公司\",\n" +
            "                        \"pawnName\": \"隔离膜收放卷装置\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：2.00；质量：良好；状况：完好；所在地：宁德\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技有限公司\",\n" +
            "                        \"pawnName\": \"盐雾机\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    },\n" +
            "                    {\n" +
            "                        \"detail\": \"数量：12.00；质量：良好；状况：完好；所在地：宁德\",\n" +
            "                        \"ownership\": \"宁德时代新能源科技有限公司\",\n" +
            "                        \"pawnName\": \"自动卷绕机\",\n" +
            "                        \"remark\": \"\"\n" +
            "                    }\n" +
            "                ],\n" +
            "                \"peopleInfo\": [\n" +
            "                    {\n" +
            "                        \"licenseNum\": \"\",\n" +
            "                        \"licenseType\": \"营业执照\",\n" +
            "                        \"peopleName\": \"东莞新能源科技有限公司\"\n" +
            "                    }\n" +
            "                ]\n" +
            "            }\n" +
            "        ],\n" +
            "        \"historyCount\": 0\n" +
            "    }\n" +
            "}\n";

    private static void explain1() {
        JSONObject response = JSON.parseObject(str, JSONObject.class);
        JSONObject jsonObject = response.getJSONObject("data");
        System.out.println(jsonObject);
        Long total = Optional.ofNullable(jsonObject.getJSONObject("Paging")).orElse(new JSONObject() {{
            put("TotalRecords", 0);
        }}).getLong("TotalRecords");
        System.out.println(total);

        List<JSONObject> items = Optional.ofNullable(jsonObject.getJSONArray("Items")).orElse(new JSONArray()).toJavaList(JSONObject.class);
        System.out.println(items.size());

        if (items.size() > 0) {
            List<JSONObject> collect = items.stream().map(item -> {
                JSONObject object = new JSONObject();
                System.out.println(item.getString("PublishDate"));
                if (StringUtils.isNoneBlank(item.getString("PublishDate"))) {
                    object.put("x", item.getString("PublishDate"));
                }
                return object;
            }).collect(Collectors.toList());
            System.out.println(collect);
        }
    }

    private static void explain2() {

    }

    public static void main(String[] args) {

    }

}
