package learn.demo.变量.String;

/**
 * @FileName: StringLengthTest
 * @Author: code-fusheng
 * @Date: 2022/3/24 15:12
 * @Version: 1.0
 * @Description:
 */

public class StringLengthTest {

    public static void main(String[] args) {

         //String exp = "发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工资发放工";
      String exp = "xx";
     System.out.println(exp.length());
     if (exp.length() >= 500) {
          System.out.println("xxx");
         }

    }

}
